       identification division.
       program-id. hello.
       environment division.
       data division.
       procedure division.
       main.
           display 'Hello, world!'.
           stop run.
